package commands;

/**
 * Интерфейс за всички команди в библиотечната система.
 * @author Емил Долчинков
 */
public interface Command {

    /**
     * Проверява дали командата изисква потребителят да е влязъл в системата.
     * @return true, ако се изисква влизане, в противен случай false.
     */
    boolean RequiresLogIn();

    /**
     * Проверява дали командата изисква потребителят да е излязъл от системата.
     * @return true, ако се изисква излизане, в противен случай false.
     */
    boolean RequiresLogOut();

    /**
     * Проверява дали командата изисква администраторски привилегии.
     * @return true, ако се изискват администраторски привилегии, в противен случай false.
     */
    boolean RequiresAdmin();

    /**
     * Изпълнява логиката на командата.
     * @param context Контекстът на командата, съдържащ необходимите данни.
     * @return true, ако изпълнението е успешно, в противен случай false.
     */
    boolean Execute(CommandContext context);
}
