package commands;

/**
 * Изброяване на наличните кодове за команди в приложението.
 *
 * @author Емил Долчинков
 */
public enum CommandCode {
    /** Команда за влизане */
    LogIn,
    /** Команда за излизане */
    LogOut,
    /** Команда за отваряне на файл */
    Open,
    /** Команда за затваряне на файл */
    Close,
    /** Команда за запазване на текущия файл */
    Save,
    /** Команда за запазване на текущия файл като */
    SaveAs,
    /** Команда за помощ */
    Help,
    /** Команда за изход от приложението */
    Exit,
    /** Команда за списък на всички книги */
    BooksAll,
    /** Команда за намиране на книги */
    BooksFind,
    /** Команда за сортиране на книги */
    BooksSort,
    /** Команда за добавяне на книга */
    BooksAdd,
    /** Команда за премахване на книга */
    BooksRemove,
    /** Команда за добавяне на потребител */
    UsersAdd,
    /** Команда за премахване на потребител */
    UsersRemove,
}
